#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vault_auth_backend.approle will be created
  + resource "vault_auth_backend" "approle" {
      + accessor        = (known after apply)
      + disable_remount = false
      + id              = (known after apply)
      + path            = (known after apply)
      + tune            = (known after apply)
      + type            = "approle"
    }

  # vault_auth_backend.userpass will be created
  + resource "vault_auth_backend" "userpass" {
      + accessor        = (known after apply)
      + description     = "UserPass auth"
      + disable_remount = false
      + id              = (known after apply)
      + path            = (known after apply)
      + tune            = [
          + {
              + allowed_response_headers     = []
              + audit_non_hmac_request_keys  = []
              + audit_non_hmac_response_keys = []
              + default_lease_ttl            = "43200s"
              + listing_visibility           = ""
              + max_lease_ttl                = "604800s"
              + passthrough_request_headers  = []
              + token_type                   = ""
            },
        ]
      + type            = "userpass"
    }

  # vault_kv_secret_backend_v2.secrets will be created
  + resource "vault_kv_secret_backend_v2" "secrets" {
      + cas_required = (known after apply)
      + id           = (known after apply)
      + max_versions = (known after apply)
      + mount        = "secret"
    }

  # vault_mount.pki_intermediate will be created
  + resource "vault_mount" "pki_intermediate" {
      + accessor                     = (known after apply)
      + audit_non_hmac_request_keys  = (known after apply)
      + audit_non_hmac_response_keys = (known after apply)
      + default_lease_ttl_seconds    = (known after apply)
      + description                  = "PKI engine with intermediate key for "
      + external_entropy_access      = false
      + id                           = (known after apply)
      + max_lease_ttl_seconds        = 157680000
      + path                         = "pki"
      + seal_wrap                    = (known after apply)
      + type                         = "pki"
    }

  # vault_mount.root_ca_v1 will be created
  + resource "vault_mount" "root_ca_v1" {
      + accessor                     = (known after apply)
      + audit_non_hmac_request_keys  = (known after apply)
      + audit_non_hmac_response_keys = (known after apply)
      + default_lease_ttl_seconds    = 157680000
      + description                  = "PKI engine CA Cert Engine"
      + external_entropy_access      = false
      + id                           = (known after apply)
      + max_lease_ttl_seconds        = 315360000
      + path                         = "ca/v1"
      + seal_wrap                    = (known after apply)
      + type                         = "pki"
    }

  # vault_mount.secret will be created
  + resource "vault_mount" "secret" {
      + accessor                     = (known after apply)
      + audit_non_hmac_request_keys  = (known after apply)
      + audit_non_hmac_response_keys = (known after apply)
      + default_lease_ttl_seconds    = (known after apply)
      + description                  = "KV2 Secrets Engine"
      + external_entropy_access      = false
      + id                           = (known after apply)
      + max_lease_ttl_seconds        = (known after apply)
      + options                      = {
          + "version" = "2"
        }
      + path                         = "secret"
      + seal_wrap                    = (known after apply)
      + type                         = "kv"
    }

  # vault_password_policy.default-password will be created
  + resource "vault_password_policy" "default-password" {
      + id     = (known after apply)
      + name   = "default"
      + policy = <<-EOT
            length=20
            
            rule "charset" {
              charset = "abcdefghijklmnopqrstuvwxyz"
              min-chars = 2
            }
            
            rule "charset" {
              charset = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
              min-chars = 2
            }
            
            rule "charset" {
              charset = "0123456789"
              min-chars = 2
            }
            
            rule "charset" {
              charset = "!@#$%^&*"
              min-chars = 2
            }
        EOT
    }

  # vault_password_policy.plain-password will be created
  + resource "vault_password_policy" "plain-password" {
      + id     = (known after apply)
      + name   = "plain"
      + policy = <<-EOT
            length=20
            
            rule "charset" {
              charset = "abcdefghijklmnopqrstuvwxyz"
              min-chars = 2
            }
            
            rule "charset" {
              charset = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
              min-chars = 2
            }
            
            rule "charset" {
              charset = "0123456789"
              min-chars = 2
            }
        EOT
    }

  # vault_pki_secret_backend_intermediate_cert_request.pki_intermediate will be created
  + resource "vault_pki_secret_backend_intermediate_cert_request" "pki_intermediate" {
      + add_basic_constraints = false
      + backend               = "pki"
      + common_name           = "Intermediate 2023"
      + csr                   = (known after apply)
      + format                = "pem"
      + id                    = (known after apply)
      + key_bits              = 4096
      + key_type              = "rsa"
      + private_key           = (sensitive value)
      + private_key_format    = "der"
      + private_key_type      = (known after apply)
      + type                  = "internal"
    }

  # vault_pki_secret_backend_intermediate_set_signed.pki_intermediate will be created
  + resource "vault_pki_secret_backend_intermediate_set_signed" "pki_intermediate" {
      + backend     = "pki"
      + certificate = (known after apply)
      + id          = (known after apply)
    }

  # vault_pki_secret_backend_role.intermediate will be created
  + resource "vault_pki_secret_backend_role" "intermediate" {
      + allow_any_name                     = false
      + allow_bare_domains                 = false
      + allow_glob_domains                 = false
      + allow_ip_sans                      = true
      + allow_localhost                    = false
      + allow_subdomains                   = true
      + allowed_domains                    = [
          + "",
        ]
      + allowed_domains_template           = false
      + backend                            = "pki"
      + basic_constraints_valid_for_non_ca = false
      + client_flag                        = true
      + code_signing_flag                  = false
      + country                            = [
          + "",
        ]
      + email_protection_flag              = false
      + enforce_hostnames                  = true
      + generate_lease                     = false
      + id                                 = (known after apply)
      + key_bits                           = 4096
      + key_type                           = "rsa"
      + key_usage                          = [
          + "DigitalSignature",
        ]
      + locality                           = [
          + "",
        ]
      + max_ttl                            = (known after apply)
      + no_store                           = true
      + not_before_duration                = (known after apply)
      + province                           = [
          + "",
        ]
      + require_cn                         = true
      + server_flag                        = true
      + ttl                                = "604800"
      + use_csr_common_name                = true
      + use_csr_sans                       = true
    }

  # vault_pki_secret_backend_root_cert.root_ca_v1 will be created
  + resource "vault_pki_secret_backend_root_cert" "root_ca_v1" {
      + backend              = "ca/v1"
      + certificate          = (known after apply)
      + common_name          = "Root CA 2023"
      + exclude_cn_from_sans = true
      + format               = "pem"
      + id                   = (known after apply)
      + issuing_ca           = (known after apply)
      + key_bits             = 4096
      + key_type             = "rsa"
      + managed_key_id       = (known after apply)
      + managed_key_name     = (known after apply)
      + max_path_length      = -1
      + private_key_format   = "der"
      + serial               = (known after apply)
      + serial_number        = (known after apply)
      + ttl                  = "315360000"
      + type                 = "internal"
    }

  # vault_pki_secret_backend_root_sign_intermediate.pki_intermediate will be created
  + resource "vault_pki_secret_backend_root_sign_intermediate" "pki_intermediate" {
      + backend              = "ca/v1"
      + ca_chain             = (known after apply)
      + certificate          = (known after apply)
      + certificate_bundle   = (known after apply)
      + common_name          = "Intermediate 2023"
      + csr                  = (known after apply)
      + exclude_cn_from_sans = true
      + format               = "pem"
      + id                   = (known after apply)
      + issuing_ca           = (known after apply)
      + max_path_length      = 1
      + revoke               = false
      + serial               = (known after apply)
      + serial_number        = (known after apply)
      + ttl                  = "94608000"
      + use_csr_values       = false
    }

  # vault_policy.kv_all will be created
  + resource "vault_policy" "kv_all" {
      + id     = (known after apply)
      + name   = "kv_all"
      + policy = <<-EOT
            path "secret/*" {
              capabilities = ["create", "read", "update", "delete", "list", "patch"]
            }
        EOT
    }

  # vault_policy.pki will be created
  + resource "vault_policy" "pki" {
      + id     = (known after apply)
      + name   = "pki"
      + policy = <<-EOT
            path "pki*" {
              capabilities = ["read", "list"]
            }
            path "pki/roles/" {
              capabilities = ["create", "update"]
            }
            path "pki/sign/" {
              capabilities = ["create", "update"]
            }
            path "pki/issue/" {
              capabilities = ["create", "update"]
            }
        EOT
    }

Plan: 15 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @sirance, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*